import { useState } from 'react';
import AccordionLayout from 'sections/Faq/FaqLayout';

const Faq = () => {
  const [activeIndex1, setActiveIndex1] = useState<string | number>(1);
  return (
    <div className='bg-fuchsia-50 dark:bg-gray-700'>
      <h2 className='lg:pt:16 pt-10 text-center font-heading text-3xl font-bold text-gray-800 dark:text-gray-200 lg:text-4xl'>
        அடிக்கடி கேட்கப்படும் கேள்விகள்
      </h2>
      <div className='px-3 pb-10 lg:pb-16'>
        <div className='mx-auto mt-10 flex max-w-6xl flex-col justify-center'>
          {data.map((items) => (
            <AccordionLayout
              title={items.Question}
              key={items.id}
              index={items.id}
              activeIndex={activeIndex1}
              setActiveIndex={setActiveIndex1}
            >
              {items.Answer}
            </AccordionLayout>
          ))}
        </div>
      </div>
    </div>
  );
};

export default Faq;

const data = [
  {
    id: 1,
    Question: 'கருவுறாமை என்றால் என்ன',
    Answer:
      'கருவுறாமை என்பது ஒரு மருத்துவ நிலை, இதில் ஒரு தம்பதியினர் குறைந்தது ஒரு வருடமாவது வழக்கமான பாதுகாப்பற்ற உடலுறவு கொண்டாலும் கருத்தரிக்க முடியாது.',
  },
  {
    id: 2,
    Question: 'பெண்களில் கருவுறாமைக்கான பொதுவான காரணங்கள் யாவை?',
    Answer:
      'பெண்களில் கருவுறாமைக்கான பொதுவான காரணங்களில் ஹார்மோன் சமநிலையின்மை, அண்டவிடுப்பின் கோளாறுகள், கருப்பை அல்லது ஃபலோபியன் குழாய் அசாதாரணங்கள், எண்டோமெட்ரியோசிஸ் மற்றும் வயது தொடர்பான  காரணங்கள் ஆகியவை அடங்கும்.',
  },
  {
    id: 3,
    Question: 'ஆண்களில் கருவுறாமைக்கான பொதுவான காரணங்கள் யாவை?',
    Answer:
      'ஆண்களில் மலட்டுத்தன்மைக்கான பொதுவான காரணங்களில் விந்தணு அசாதாரணங்கள், குறைந்த விந்தணு எண்ணிக்கை, விந்தணு இயக்கத்தில் உள்ள சிக்கல்கள் மற்றும் மரபணு  காரணங்கள் ஆகியவை அடங்கும்.',
  },
  {
    id: 4,
    Question: 'கருவுறாமைக்கான சிகிச்சை விருப்பங்கள் என்ன?',
    Answer:
      'கருவுறாமைக்கான குறிப்பிட்ட காரணத்தைப் பொறுத்து, கருவுறாமை சிகிச்சை விருப்பங்களில் கருப்பையக கருவூட்டல் (IUI), விட்ரோ கருத்தரித்தல் (IVF), இன்ட்ராசைட்டோபிளாஸ்மிக் விந்து ஊசி (ICSI) மற்றும் பிற உதவி இனப்பெருக்க தொழில்நுட்பங்கள் ஆகியவை அடங்கும்.',
  },
  {
    id: 5,
    Question: 'கருவுறாமை சிகிச்சை எவ்வளவு வெற்றிகரமாக உள்ளது?',
    Answer:
      'குழந்தையின்மை சிகிச்சையின் வெற்றி விகிதங்கள் வயது, குழந்தையின்மைக்கான காரணம் மற்றும் சிகிச்சை முறை போன்ற காரணங்களைப் பொறுத்து மாறுபடும். எங்கள் கருவுறுதல் நிபுணர்கள் சிறந்த முடிவுகளை அடைய நோயாளிகளுடன் நெருக்கமாக பணியாற்றுகிறார்கள்.',
  },
  {
    id: 6,
    Question: 'வயது கருவுறுதலை பாதிக்குமா?',
    Answer:
      'ஆம், வயது கருத்தரிப்பில் குறிப்பிடத்தக்க தாக்கத்தை ஏற்படுத்துகிறது. ஒருவரின் வயது அதிகரிக்கும் போது கருத்தரிப்பு திறன் குறைய ச்செய்யும், குறிப்பாக பெண்களுக்கு. பெண்கள் வரையறுக்கப்பட்ட எண்ணிக்கையிலான முட்டைகளுடன் பிறக்கின்றனர், மேலும் அவற்றின் தரமும் எண்ணிக்கையும் காலப்போக்கில் குறையத் தொடங்குகின்றன. இதனால் கருவுறுவதில் சிரமங்கள், கருக்கலைப்பு அபாயம், பிறப்பு குறைபாடுகள் ஆகியவை வயதுடன் அதிகரிக்கலாம். ஆண்களும் வயதுக்கு இணையாக கருத்தரிப்பு திறனில் படிப்படியாக குறைவைக் காண்கிறார்கள். இது விந்தணுவின் தரம் மற்றும் இனப்பெருக்க செயல்பாட்டில் பாதிப்பை ஏற்படுத்தக்கூடும்',
  },
  {
    id: 7,
    Question: 'குழந்தையின்மை சிகிச்சைக்கு எவ்வளவு செலவாகும்?',
    Answer:
      'கருத்தரிப்பு சிகிச்சையின் செலவு பல காரணங்களின் அடிப்படையில் மாறுபடும். எடுத்துக்காட்டாக, தேர்ந்தெடுக்கப்படும் சிகிச்சை முறை, மருத்துவமனை அல்லது கிளினிக், மேலும் நோயாளியின் தனிப்பட்ட உடல்நிலை போன்றவை செலவை தீர்மானிக்கும்.எனவே, உங்கள் நிலைக்கு ஏற்ப துல்லியமான செலவு மதிப்பீட்டை பெற, கருத்தரிப்பு நிபுணருடனும் நீங்கள் தேர்வு செய்யும் கிளினிக்குடனும் ஆலோசிப்பது மிகவும் அவசியம்.',
  },
  {
    id: 8,
    Question: 'கருவுறாமை சிகிச்சைக்குப் பிறகு கர்பமாக இருக்க எவ்வளவு நேரம் ஆகும்?',
    Answer:
      'கருத்தரிப்பு சிகிச்சைக்கு பின் கர்ப்பம் அடையும் நேரம் பல காரணங்களின் அடிப்படையில் மாறுபடும். அது எந்த சிகிச்சை செய்யப்படுகிறது, தனிநபரின் உடல்நிலை, மற்றும் சிகிச்சையின் வெற்றித்தரம் ஆகியவற்றைப் பொறுத்தது.சில தம்பதிகள் முதல் சிகிச்சை சுழற்சியிலேயே கர்பம் அடையலாம், ஆனால் சிலருக்கு பல சுழற்சிகள் தேவைப்படலாம். எடுத்துக்காட்டாக, IVF சிகிச்சையில், முட்டை உற்பத்தி தூண்டுதல் முதல் கருவியல் மாற்றம் வரை சில வாரங்கள் ஆகும். கருவியல் மாற்றம் செய்யப்பட்ட பின், கர்பம் ஏற்பட்டதா என்பதை அறிய சுமார் 10–14 நாட்களுக்கு பிறகு கர்பச் சோதனை செய்யப்படுகிறது. ஆனால், எல்லா கருத்தரிப்பு சிகிச்சைகளும் கர்பத்திற்கு வழிவகுக்கும் என்று சொல்ல முடியாது. சிலர் கூடுதல் நேரம் எடுக்க வேண்டியிருக்கலாம் அல்லது சிகிச்சை திட்டத்தில் மாற்றங்கள் தேவைப்படலாம்.',
  },
];
